MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tamp.c
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_tamp.c
  * @brief   TAMP HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the TAMP peripheral:
  *           + Passive tamper events
  *           + Internal tamper events
  *           + Device secrets protection
  *           + Backup registers
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

/** @addtogroup TAMP
  * @brief TAMP HAL module driver.
  * @{
  */
/** @defgroup TAMP_Introduction TAMP Introduction
  * @{

  - The tamper (TAMP) peripheral is designed to enhance security by detecting unauthorized access or tampering events.
    It monitors external tamper pins and internal events, such as backup register corruption, to trigger appropriate
    responses.
    The TAMP peripheral supports multiple tamper detection channels, each configurable for specific security needs.
    It integrates seamlessly with the backup domain, ensuring secure data retention during power failures.
    Additionally, the TAMP peripheral offers advanced features like timestamping tamper events and filtering noise to
    prevent false detections.
    This makes it an essential component for applications requiring robust security and data integrity.
  */
/**
  * @}
  */

/** @defgroup TAMP_How_To_Use TAMP How To Use
  * @{
  * The antitamper detection circuit is used to protect sensitive data from external attacks.
  * Detection occurs on events from the different tamper I/O or from internal monitors detecting out-of-range
  * device conditions.
  *
  * The TAMP driver provides:
  * * external tampers that can operate in:
  *   * passive mode with ultra-low power edge or level detection.
  * * internal tampers to protect against transient or environmental perturbation of the microcontroller.
  * * backup register read/write.
  * * configuration of device secrets protection.
  *
  * # TAMP operating condition
  *
  * The TAMP clock, also used by the RTC driver, is called RTCCLK and can come from different sources:
  * - HSE
  * - LSE
  * - LSI
  *
  * # RTC domain reset
  *
  * The RTC domain reset sets all TAMP registers and the RCC_RTCCR register to their reset values.
  * An RTC domain reset occurs when:
  * * triggered by setting the RTCDRST bit in the RCC RTC domain control register (RCC_RTCCR).
  * * totally powering off the microcontroller.
  *
  * # RTC domain access
  *
  * After reset, the RTC domain (RCC RTC domain control register (RCC_RTCCR), RTC registers, TAMP registers
  * and backup registers) is protected.
  *
  * To enable access to the TAMP domain and TAMP registers, do the following:
  * * Enable the clock driving the power controller interface using the HAL_RCC_PWR_EnableClock function
  * * Enable access to RTC domain using the HAL_PWR_DisableRTCDomainWriteProtection function.
  * * Select the RTC clock source using the HAL_RCC_RTC_SetKernelClkSource function.
  * * Enable RTCAPB clock using the HAL_RCC_RTCAPB_EnableClock function.
  *
  * # TAMP and microcontroller low power modes
  *
  * The MCU can be woken up from low power mode by a tamper event.
  */
/**
  * @}
  */

/** @defgroup TAMP_Configuration_Table TAMP Configuration Table
  * @{
# Configuration inside the TAMP driver

Config defines                | Description      | Default value         | Note
------------------------------| -----------------| --------------------- | --------------------------------------------
USE_HAL_TAMP_MODULE           | hal_conf.h       | 1                     | When set, HAL TAMP module is enabled
USE_HAL_CHECK_PARAM           | hal_conf.h       | 0                     | When set, parameters are checked in runtime
USE_ASSERT_DBG_PARAM          | PreProcessor env | NA                    | When defined, enable the params assert

  */
/**
  * @}
  */

#if defined(USE_HAL_TAMP_MODULE) && (USE_HAL_TAMP_MODULE == 1)

/* Private types -----------------------------------------------------------*/
/** @defgroup TAMP_Private_Types TAMP Private Types
  * @{
  */

/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/
/** @defgroup TAMP_Private_Constants TAMP Private Constants
  * @{
  */

/**
  * @}
  */

/* Private macros -------------------------------------------------------------*/
/** @defgroup TAMP_Private_Macros TAMP Private Macros
  * @{
  */

/*! Tests tampers */
#define IS_TAMP_TAMPERS(tampers)  (((((tampers) & HAL_TAMP_TAMPER_1) == HAL_TAMP_TAMPER_1)     \
                                    || (((tampers) & HAL_TAMP_TAMPER_2) == HAL_TAMP_TAMPER_2)  \
                                    || (((tampers) & HAL_TAMP_TAMPER_3) == HAL_TAMP_TAMPER_3)) \
                                   && (((tampers) & (~HAL_TAMP_TAMPER_ALL)) == 0U))

/*! Tests tampers interruption */
#define IS_TAMP_TAMPERS_IT(interruption) (((((interruption) & HAL_TAMP_IT_TAMPER_1) == HAL_TAMP_IT_TAMPER_1)    \
                                           || (((interruption) & HAL_TAMP_IT_TAMPER_2) == HAL_TAMP_IT_TAMPER_2) \
                                           || (((interruption) & HAL_TAMP_IT_TAMPER_3) == HAL_TAMP_IT_TAMPER_3) \
                                           || (interruption) == HAL_TAMP_IT_NONE) \
                                          && (((interruption) & (~HAL_TAMP_IT_ALL)) == 0U))


/*! Tests passive tamper precharge state */
#define IS_TAMP_PASSIVE_PRECHARGE_STATE(state) (((state) == HAL_TAMP_PASSIVE_PULL_UP_PRECHARGE_DISABLE ) \
                                                || ((state) == HAL_TAMP_PASSIVE_PULL_UP_PRECHARGE_ENABLE ))

/*! Tests passive tamper precharge duration */
#define IS_TAMP_PASSIVE_PRECHARGE_DURATION(duration) \
  (((duration) == HAL_TAMP_PASSIVE_PULL_UP_PRECHARGE_1_RTCCLK )    \
   || ((duration) == HAL_TAMP_PASSIVE_PULL_UP_PRECHARGE_2_RTCCLK ) \
   || ((duration) == HAL_TAMP_PASSIVE_PULL_UP_PRECHARGE_4_RTCCLK ) \
   || ((duration) == HAL_TAMP_PASSIVE_PULL_UP_PRECHARGE_8_RTCCLK ))

/*! Tests passive tamper filter */
#define IS_TAMP_PASSIVE_FILTER(filter) (((filter) == HAL_TAMP_PASSIVE_FILTER_DISABLE )      \
                                        || ((filter) == HAL_TAMP_PASSIVE_FILTER_2_SAMPLES ) \
                                        || ((filter) == HAL_TAMP_PASSIVE_FILTER_4_SAMPLES ) \
                                        || ((filter) == HAL_TAMP_PASSIVE_FILTER_8_SAMPLES ))

/*! Tests passive tamper sample frequency */
#define IS_TAMP_PASSIVE_SAMPLE_FREQUENCY(frequency) (((frequency) == HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_256 )      \
                                                     || ((frequency) == HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_512 )   \
                                                     || ((frequency) == HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_1024 )  \
                                                     || ((frequency) == HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_2048 )  \
                                                     || ((frequency) == HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_4096 )  \
                                                     || ((frequency) == HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_8192 )  \
                                                     || ((frequency) == HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_16384 ) \
                                                     || ((frequency) == HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_32768 ))

