MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tamp.c
/*! Tests passive tamper detection */
#define IS_TAMP_PASSIVE_DETECTION(detection) (((detection) == HAL_TAMP_PASSIVE_TRIGGER_RISING )    \
                                              || ((detection) == HAL_TAMP_PASSIVE_TRIGGER_FALLING) \
                                              || ((detection) == HAL_TAMP_PASSIVE_TRIGGER_LOW)     \
                                              || ((detection) == HAL_TAMP_PASSIVE_TRIGGER_HIGH))

/*! Tests passive tamper erase mode */
#define IS_TAMP_PASSIVE_ERASE(mode) (((mode) == HAL_TAMP_PASSIVE_SECRETS_ERASE ) \
                                     || ((mode) == HAL_TAMP_PASSIVE_SECRETS_NO_ERASE ))

/*! Tests passive tamper mask status */
#define IS_TAMP_PASSIVE_MASK(mask) (((mask) == HAL_TAMP_PASSIVE_UNMASKED ) \
                                    || ((mask) == HAL_TAMP_PASSIVE_MASKED ))

/*! Tests internal tampers */
#define IS_TAMP_INTERNAL_TAMPERS(tampers) (((((tampers) & HAL_TAMP_INTERNAL_TAMPER_3)     \
                                             == HAL_TAMP_INTERNAL_TAMPER_3)     \
                                            || (((tampers) & HAL_TAMP_INTERNAL_TAMPER_4)  \
                                                == HAL_TAMP_INTERNAL_TAMPER_4)   \
                                            || (((tampers) & HAL_TAMP_INTERNAL_TAMPER_5)  \
                                                == HAL_TAMP_INTERNAL_TAMPER_5)   \
                                            || (((tampers) & HAL_TAMP_INTERNAL_TAMPER_6)  \
                                                == HAL_TAMP_INTERNAL_TAMPER_6)   \
                                            || (((tampers) & HAL_TAMP_INTERNAL_TAMPER_9)  \
                                                == HAL_TAMP_INTERNAL_TAMPER_9)   \
                                            || (((tampers) & HAL_TAMP_INTERNAL_TAMPER_11) \
                                                == HAL_TAMP_INTERNAL_TAMPER_11)) \
                                           && (((tampers) & (~HAL_TAMP_INTERNAL_ALL)) == 0U))
/*!< Tests internal tampers */

/*! Tests internal tampers interruption */
#define IS_TAMP_INTERNAL_TAMPERS_IT(interruption) (((((interruption) & HAL_TAMP_INTERNAL_IT_TAMPER_3)     \
                                                     == HAL_TAMP_INTERNAL_IT_TAMPER_3)     \
                                                    || (((interruption) & HAL_TAMP_INTERNAL_IT_TAMPER_4)  \
                                                        == HAL_TAMP_INTERNAL_IT_TAMPER_4)  \
                                                    || (((interruption) & HAL_TAMP_INTERNAL_IT_TAMPER_5)  \
                                                        == HAL_TAMP_INTERNAL_IT_TAMPER_5)  \
                                                    || (((interruption) & HAL_TAMP_INTERNAL_IT_TAMPER_6)  \
                                                        == HAL_TAMP_INTERNAL_IT_TAMPER_6)  \
                                                    || (((interruption) & HAL_TAMP_INTERNAL_IT_TAMPER_9)  \
                                                        == HAL_TAMP_INTERNAL_IT_TAMPER_9)  \
                                                    || (((interruption) & HAL_TAMP_INTERNAL_IT_TAMPER_11) \
                                                        == HAL_TAMP_INTERNAL_IT_TAMPER_11) \
                                                    || (interruption) == HAL_TAMP_INTERNAL_IT_NONE)       \
                                                   && (((interruption) & (~HAL_TAMP_INTERNAL_IT_ALL)) == 0U))
/*!< Tests internal tamper interrupts */

/*! Tests internal tamper erase mode */
#define IS_TAMP_INTERNAL_ERASE(mode) (((mode) == HAL_TAMP_INTERNAL_SECRETS_ERASE ) \
                                      || ((mode) == HAL_TAMP_INTERNAL_SECRETS_NO_ERASE ))

/*! Tests remap */
#define IS_TAMP_REMAP(remap) (((remap) == HAL_TAMP_REMAP_TAMP_IN2_PA0_TO_PC1) \
                              || ((remap) == HAL_TAMP_REMAP_TAMP_IN3_PA1_TO_PA2))
/*!< Tests remap */

/*! Tests backup registers */
#define IS_TAMP_BACKUP_REGISTER(backup) ((backup) < LL_TAMP_BACKUP_NB )

/*! Test privilege attribute value */
#define IS_TAMP_ITEM_PRIV_ATTR(attribute) ((attribute == HAL_TAMP_PRIV) || (attribute == HAL_TAMP_NPRIV))

/*! Test privilege item selector */
#define IS_TAMP_PRIV_ITEM(item) (((item) == HAL_TAMP_PRIV_ITEM_TAMP) \
                                 || ((item) == HAL_TAMP_PRIV_ITEM_BACKUP_ZONE_1) \
                                 || ((item) == HAL_TAMP_PRIV_ITEM_BACKUP_ZONE_2))

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup TAMP_Private_Variables TAMP Private Variables
  * @{
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup TAMP_Exported_Functions
  * @{
  */

/** @addtogroup TAMP_Exported_Functions_Passive
  * @{
  *
  * In passive mode the tampers inputs are monitored and a tamper is detected
  * either on edge or level detection. Those different detection types can be configured
  * by changing the parameters of a digital filter that are common for all the passive
  * tampers. This filter is used to avoid false tamper detection.
  * The passive tampers can work in confirmed or potential modes.
  *
  * # Passive tampers
  * ## Edge detection
  *
  * Edge mode consists of a tamper event generation when either a rising or falling edge
  * is observed. To configure the tampers in edge mode, the application must call @ref HAL_TAMP_PASSIVE_SetConfig
  * with @ref hal_tamp_passive_config_t::type_activation set to @ref HAL_TAMP_PASSIVE_FILTER_DISABLE.
  * The parameter @ref hal_tamp_passive_individual_config_t::trigger must be set to the desired edge type
  * by calling the @ref HAL_TAMP_PASSIVE_SetConfigTampers.
  *
  * The user can use this mode of tamper detection with the RTCCLK disabled.
  *
  * ## Level detection
  *
  * Level mode consists of a tamper event generation when two, four or eight consecutive samples are observed
  * at the level configured. Calling the @ref HAL_TAMP_PASSIVE_SetConfigTampers and setting
  * @ref hal_tamp_passive_individual_config_t::trigger enables the configuration of the level.
  * To configure the tampers in level mode, the application must call @ref HAL_TAMP_PASSIVE_SetConfig
  * with @ref hal_tamp_passive_config_t::type_activation set to:
  * * @ref HAL_TAMP_PASSIVE_FILTER_2_SAMPLES, for two samples detection.
  * * @ref HAL_TAMP_PASSIVE_FILTER_4_SAMPLES, for four samples detection.
  * * @ref HAL_TAMP_PASSIVE_FILTER_8_SAMPLES, for eight samples detection.
  *
  * The sampling frequency is chosen by programming the @ref hal_tamp_passive_config_t::sample_frequency
  *
  * The inputs can be precharged before being sampled for a certain duration. Configure this by calling
  * @ref HAL_TAMP_PASSIVE_SetConfig and programming the parameters
  * @ref hal_tamp_passive_config_t::precharge and
  * @ref hal_tamp_passive_config_t::precharge_duration
  *
  * # Potential and confirmed mode.
  *
  * Each tamper can work in two modes regarding device secrets erase. The confirmed mode means
  * that when a tamper event occurs, the device secrets are automatically erased. The potential mode
  * does not erase all the device secrets when a tamper event occurs. Instead, it blocks read and write
  * access to the device secrets. Access is unblocked when the tamper event is cleared.
  * To configure the erase mode, call @ref HAL_TAMP_PASSIVE_SetConfigTampers and configure
  * the hal_tamp_passive_individual_config_t::erase_secrets parameter.
  *
  * # Masked
  *
  * The tampers can be masked. This means that the application does not need to clear them  after a trigger.
  * If a tamper is masked, triggering the tamper event will not affect the device secrets in any way.
  * This feature is only available when using passive tampers in level mode and interrupts are disabled.
  *
  */

/**
  * @brief Configure the passive tampers global parameters.
  * @param p_config Pointer to the passive tampers global configuration instance.
  * @retval HAL_OK if the configuration is successful, HAL_INVALID_PARAM if the parameter is invalid.
  */
hal_status_t HAL_TAMP_PASSIVE_SetConfig(const hal_tamp_passive_config_t *p_config)
{

  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_TAMP_PASSIVE_PRECHARGE_STATE(p_config->precharge));
  ASSERT_DBG_PARAM(IS_TAMP_PASSIVE_PRECHARGE_DURATION(p_config->precharge_duration));
  ASSERT_DBG_PARAM(IS_TAMP_PASSIVE_FILTER(p_config->type_activation));
  ASSERT_DBG_PARAM(IS_TAMP_PASSIVE_SAMPLE_FREQUENCY(p_config->sample_frequency));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

