MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tamp.c
  LL_TAMP_SetConfig((uint32_t) p_config->precharge,
                    (uint32_t) p_config->precharge_duration,
                    (uint32_t) p_config->type_activation,
                    (uint32_t) p_config->sample_frequency);

  return HAL_OK;
}

/**
  * @brief Retrieve the passive tamper global parameters.
  * @param p_config Pointer to the passive tampers global configuration instance.
  */
void HAL_TAMP_PASSIVE_GetConfig(hal_tamp_passive_config_t *p_config)
{
  uint32_t config_tampers = LL_TAMP_GetConfig();

  ASSERT_DBG_PARAM(p_config != NULL);

  p_config->precharge = (hal_tamp_passive_pull_up_precharge_state_t) LL_TAMP_GET_PULL_UP(config_tampers);
  p_config->precharge_duration = (hal_tamp_passive_pull_up_precharge_duration_t) \
                                 LL_TAMP_GET_PRECHARGE_DURATION(config_tampers);
  p_config->type_activation = (hal_tamp_passive_filter_t) LL_TAMP_GET_FILTER_SAMPLE(config_tampers);
  p_config->sample_frequency = (hal_tamp_passive_sample_frequency_t) \
                               LL_TAMP_GET_FILTER_SAMPLE_FREQUENCY(config_tampers);

}

/**
  * @brief Configure the passive tampers individual parameters.
  * @param tampers tampers to be configured, can be a combination of
  *        @arg @ref HAL_TAMP_TAMPER_1
  *        @arg @ref HAL_TAMP_TAMPER_2
  *        @arg @ref HAL_TAMP_TAMPER_3
  * @param p_config Pointer to the passive tamper individual configuration instance.
  * @retval HAL_OK, HAL_INVALID_PARAM if the parameter is invalid
  */
hal_status_t HAL_TAMP_PASSIVE_SetConfigTampers(uint32_t tampers,
                                               const hal_tamp_passive_individual_config_t *p_config)
{
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_TAMP_TAMPERS(tampers));
  ASSERT_DBG_PARAM(IS_TAMP_PASSIVE_DETECTION(p_config->trigger));
  ASSERT_DBG_PARAM(IS_TAMP_PASSIVE_ERASE(p_config->erase_secrets));
  ASSERT_DBG_PARAM(IS_TAMP_PASSIVE_MASK(p_config->masked));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  LL_TAMP_SetConfigTampers(tampers, (uint32_t) p_config->trigger,
                           (uint32_t) p_config->erase_secrets,
                           (uint32_t) p_config->masked);

  return HAL_OK;
}

/**
  * @brief Retrieve the passive tamper individual parameters.
  * @param tamper tamper to retrieve the configuration, can be one of the following values
  *        @arg @ref HAL_TAMP_TAMPER_1
  *        @arg @ref HAL_TAMP_TAMPER_2
  *        @arg @ref HAL_TAMP_TAMPER_3
  * @param p_config Pointer to the passive tamper individual configuration instance.
  */
void HAL_TAMP_PASSIVE_GetConfigTamper(uint32_t tamper,
                                      hal_tamp_passive_individual_config_t *p_config)
{
  uint32_t config_tamper = LL_TAMP_GetConfigTampers(tamper);

  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_TAMP_TAMPERS(tamper));

  p_config->trigger = (hal_tamp_passive_trigger_t) LL_TAMP_GET_TRIGGER(config_tamper);
  p_config->erase_secrets = (hal_tamp_passive_secrets_erase_t) LL_TAMP_GET_NOERASE(config_tamper);
  p_config->masked = (hal_tamp_passive_mask_t) LL_TAMP_GET_MASK(config_tamper);

}

/**
  * @brief Start the passive tampers.
  * @param tampers tampers to be started, can be a combination of
  *        @arg @ref HAL_TAMP_TAMPER_1
  *        @arg @ref HAL_TAMP_TAMPER_2
  *        @arg @ref HAL_TAMP_TAMPER_3
  * @param interruption enable the interruption, can be a combination of
  *        @arg @ref HAL_TAMP_IT_NONE
  *        @arg @ref HAL_TAMP_IT_TAMPER_1
  *        @arg @ref HAL_TAMP_IT_TAMPER_2
  *        @arg @ref HAL_TAMP_IT_TAMPER_3
  * @retval HAL_OK
  * @retval HAL_ERROR If trying to enable an interruption to a masked tamper.
  */
hal_status_t HAL_TAMP_PASSIVE_Start(uint32_t tampers, uint32_t interruption)
{
  uint32_t masked_tampers = LL_TAMP_GetMasked((tampers << LL_TAMP_POSITION_FIRST_MASKED));

  ASSERT_DBG_PARAM(IS_TAMP_TAMPERS(tampers));
  ASSERT_DBG_PARAM(IS_TAMP_TAMPERS_IT(interruption));

  if ((masked_tampers & (interruption << LL_TAMP_POSITION_FIRST_MASKED)) != 0U)
  {
    return HAL_ERROR;
  }
  LL_TAMP_Enable(tampers);
  LL_TAMP_EnableIT(interruption);

  return HAL_OK;
}

/**
  * @brief Stop the passive tampers.
  * @param tampers tampers to be stopped, can be a combination of
  *        @arg @ref HAL_TAMP_TAMPER_1
  *        @arg @ref HAL_TAMP_TAMPER_2
  *        @arg @ref HAL_TAMP_TAMPER_3
  * @retval HAL_OK
  */
hal_status_t HAL_TAMP_PASSIVE_Stop(uint32_t tampers)
{
  ASSERT_DBG_PARAM(IS_TAMP_TAMPERS(tampers));

  LL_TAMP_Disable(tampers);
  LL_TAMP_DisableIT(tampers);
  LL_TAMP_ClearFlag_TAMP(tampers);

  return HAL_OK;
}

/**
  * @brief Poll for a tamper event among tampers given in @p tampers.
  * @param tampers tampers to be checked, can be a combination of
  *        @arg @ref HAL_TAMP_TAMPER_1
  *        @arg @ref HAL_TAMP_TAMPER_2
  *        @arg @ref HAL_TAMP_TAMPER_3
  * @param timeout_ms Timeout duration
  * @note  Call HAL_TAMP_PASSIVE_Stop to clear the pending tamper event.
  * @retval HAL_OK
  * @retval HAL_TIMEOUT when reaching the timeout during polling.
  */
hal_status_t HAL_TAMP_PASSIVE_PollForEvent(uint32_t tampers, uint32_t timeout_ms)
{
  uint32_t tickstart = HAL_GetTick();

  ASSERT_DBG_PARAM(IS_TAMP_TAMPERS(tampers));

  while (LL_TAMP_IsActiveFlag_TAMP(tampers) == 0U)
  {
    if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
    {
      /* New check to avoid false timeout detection in case of preemption */
      if (LL_TAMP_IsActiveFlag_TAMP(tampers) == 0U)
      {
        return HAL_TIMEOUT;
      }
      else
      {
        break;
      }
    }
  }

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup TAMP_Exported_Functions_Internal
  * @{
  *
  * The internal tampers are tampers linked to a specific part of the microcontroller. They protect
  * the microcontroller device secrets in case of transient or environmental perturbation attacks.
  * They can work in potential or confirmed mode.
  *
  * Each tamper can work in two modes regarding the device secrets erase. The confirmed mode means
  * that when a tamper event occurs, the device secrets are automatically erased. The potential mode
  * does not erase all the device secrets when a tamper event occurs. Instead, it blocks read and write
  * access to the device secrets. The access is unblocked when the tamper event is cleared.
  *
  * To configure the erase mode, call @ref HAL_TAMP_INTERNAL_SetConfigTampers and configure
  * the hal_tamp_internal_individual_config_t::erase_secrets parameter.
  *
  */

/**
  * @brief Configure the internal tampers individual parameters.
  * @param internal_tampers tampers to be configured, can be a combination of
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_3
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_4
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_5
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_6
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_9
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_11
  * @param p_config Pointer to the internal tamper individual configuration instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TAMP_INTERNAL_SetConfigTampers(uint32_t internal_tampers,
                                                const hal_tamp_internal_individual_config_t *p_config)
{
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_TAMP_INTERNAL_TAMPERS(internal_tampers));
  ASSERT_DBG_PARAM(IS_TAMP_INTERNAL_ERASE(p_config->erase_secrets));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)

  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  LL_TAMP_SetConfigInternalTampers(internal_tampers, (uint32_t) p_config->erase_secrets);

  return HAL_OK;
}

/**
  * @brief Retrieve the internal tamper individual parameter.
  * @param internal_tamper tamper to retrieve the configuration, can be one of the following values
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_3
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_4
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_5
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_6
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_9
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_11
  * @param p_config Pointer to the internal tamper individual configuration instance.
  */
void HAL_TAMP_INTERNAL_GetConfigTamper(uint32_t internal_tamper,
                                       hal_tamp_internal_individual_config_t *p_config)
{
  uint32_t config_tamper = LL_TAMP_GetConfigInternalTampers(internal_tamper);

  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_TAMP_INTERNAL_TAMPERS(internal_tamper));

  p_config->erase_secrets = (hal_tamp_internal_secrets_erase_t) LL_TAMP_INTERNAL_GET_NOERASE(config_tamper);
}

/**
  * @brief Start the internal tampers.
  * @param internal_tampers internal tampers to be started, can be a combination of
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_3
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_4
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_5
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_6
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_9
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_11
  * @param interruption enable the interruption, can be a combination of
  *        @arg @ref HAL_TAMP_INTERNAL_IT_NONE
  *        @arg @ref HAL_TAMP_INTERNAL_IT_TAMPER_3
  *        @arg @ref HAL_TAMP_INTERNAL_IT_TAMPER_4
  *        @arg @ref HAL_TAMP_INTERNAL_IT_TAMPER_5
  *        @arg @ref HAL_TAMP_INTERNAL_IT_TAMPER_6
  *        @arg @ref HAL_TAMP_INTERNAL_IT_TAMPER_9
  *        @arg @ref HAL_TAMP_INTERNAL_IT_TAMPER_11
  * @retval HAL_OK
  */
hal_status_t HAL_TAMP_INTERNAL_Start(uint32_t internal_tampers, uint32_t interruption)
{
  ASSERT_DBG_PARAM(IS_TAMP_INTERNAL_TAMPERS(internal_tampers));
  ASSERT_DBG_PARAM(IS_TAMP_INTERNAL_TAMPERS_IT(interruption));

  LL_TAMP_ITAMP_Enable(internal_tampers);
  LL_TAMP_ITAMP_EnableIT(interruption);

  return HAL_OK;
}

/**
  * @brief Stop the internal tampers.
  * @param internal_tampers tampers to be stopped, can be a combination of
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_3
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_4
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_5
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_6
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_9
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_11
  * @retval HAL_OK
  */
hal_status_t HAL_TAMP_INTERNAL_Stop(uint32_t internal_tampers)
{
  ASSERT_DBG_PARAM(IS_TAMP_INTERNAL_TAMPERS(internal_tampers));

  LL_TAMP_ITAMP_Disable(internal_tampers);
  LL_TAMP_ITAMP_DisableIT(internal_tampers);
  LL_TAMP_ClearFlag_ITAMP(internal_tampers);

  return HAL_OK;
}

/**
  * @brief Poll for a internal tamper event among internal tampers given in @p internal_tampers.
  * @param internal_tampers Internal tampers to be checked, can be a combination of
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_3
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_4
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_5
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_6
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_9
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_11
  * @param timeout_ms Timeout duration
  * @note  Call HAL_TAMP_INTERNAL_Stop to clear the pending internal tamper event.
  * @retval HAL_OK
  * @retval HAL_TIMEOUT when reaching the timeout during polling.
  */
hal_status_t HAL_TAMP_INTERNAL_PollForEvent(uint32_t internal_tampers,
                                            uint32_t timeout_ms)
{
  uint32_t tickstart = HAL_GetTick();

  ASSERT_DBG_PARAM(IS_TAMP_INTERNAL_TAMPERS(internal_tampers));

  while (LL_TAMP_IsActiveFlag_ITAMP(internal_tampers) == 0U)
  {
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
      {
        /* New check to avoid false timeout detection in case of preemption */
        if (LL_TAMP_IsActiveFlag_ITAMP(internal_tampers) == 0U)
        {
          return HAL_TIMEOUT;
        }
        else
        {
          break;
        }
      }
    }
  }

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup TAMP_Exported_Functions_IRQ
  * @{
  *
  * IRQ handler functions to manage the different tamper event interrupts.
  *
  */

/**
  * @brief IRQ handler of the different tamper interrupts.
  */
void HAL_TAMP_IRQHandler(void)
{
  uint32_t flags = LL_TAMP_READ_REG(SR);
  uint32_t flags_tamper = flags & LL_TAMP_ALL;

