MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tamp.c
  if (flags_tamper != 0U)
  {
    HAL_TAMP_TamperEventCallback(flags_tamper);
    LL_TAMP_ClearFlag_TAMP(flags_tamper);
  }
  else
  {
    uint32_t flags_internal_tamper = flags & LL_TAMP_ITAMP_ALL;
    if (flags_internal_tamper != 0U)
    {
      HAL_TAMP_InternalTamperEventCallback(flags_internal_tamper);
      LL_TAMP_ClearFlag_ITAMP(flags_internal_tamper);
    }
  }
}

/**
  * @brief IRQ handler of the external tampers interrupts.
  */
void HAL_TAMP_TamperIRQHandler(void)
{
  uint32_t flags_tamper = LL_TAMP_READ_REG(SR) & LL_TAMP_ALL;

  if (flags_tamper != 0U)
  {
    HAL_TAMP_TamperEventCallback(flags_tamper);
    LL_TAMP_ClearFlag_TAMP(flags_tamper);
  }
}

/**
  * @brief IRQ handler of the internal tampers interrupts.
  */
void HAL_TAMP_InternalTamperIRQHandler(void)
{
  uint32_t flags_internal_tamper = LL_TAMP_READ_REG(SR) & LL_TAMP_ITAMP_ALL;

  if (flags_internal_tamper != 0U)
  {
    HAL_TAMP_InternalTamperEventCallback(flags_internal_tamper);
    LL_TAMP_ClearFlag_ITAMP(flags_internal_tamper);
  }
}

/**
  * @}
  */

/** @addtogroup TAMP_Exported_Functions_Device_Secrets
  * @{
  * The device secrets consist of different resources of the microcontroller
  *
  * # Backup registers
  *
  * There are 32 backup registers.
  * The backup registers are registers that the application can write anything it wants by
  * calling @ref HAL_TAMP_WriteBackupRegisterValue .
  *
  *
  * # Device secrets access and erase.
  *
  * The application can enable and disable the access of the different device secrets by calling
  * @ref HAL_TAMP_UnblockDeviceSecretsAccess and @ref HAL_TAMP_BlockDeviceSecretsAccess respectively.
  * By default they can be accessed.
  *
  * The application can also manually erase the different device secrets by calling
  * the @ref HAL_TAMP_EraseDeviceSecrets function.
  *
  */

/**
  * @brief Program the value of the backup register given by the parameter @p backup_register_index.
  * @param backup_register_index Index of the backup register.
  * @param data_32bit Value to be programmed.
  * @retval HAL_OK
  */
hal_status_t HAL_TAMP_WriteBackupRegisterValue(hal_tamp_backup_register_idx_t backup_register_index,
                                               uint32_t data_32bit)
{
  ASSERT_DBG_PARAM(IS_TAMP_BACKUP_REGISTER((uint32_t)backup_register_index));

  LL_TAMP_BKP_SetRegister((uint32_t)backup_register_index, data_32bit);

  return HAL_OK;
}

/**
  * @brief Retrieve the value of the backup register given by the parameter @p backup_register_index.
  * @param backup_register_index Index of the backup register.
  * @retval uint32_t Value of the backup register
  */
uint32_t HAL_TAMP_ReadBackupRegisterValue(hal_tamp_backup_register_idx_t backup_register_index)
{
  ASSERT_DBG_PARAM(IS_TAMP_BACKUP_REGISTER((uint32_t)backup_register_index));

  return LL_TAMP_BKP_GetRegister((uint32_t)backup_register_index);
}


/**
  * @brief Unblock access to the backup registers and device secrets.
  * @retval HAL_OK
  */
hal_status_t HAL_TAMP_UnblockDeviceSecretsAccess(void)
{
  LL_TAMP_UnblockDeviceSecretsAccess();

  return HAL_OK;
}

/**
  * @brief Block access to the backup registers and device secrets.
  * @retval HAL_OK
  */
hal_status_t HAL_TAMP_BlockDeviceSecretsAccess(void)
{
  LL_TAMP_BlockDeviceSecretsAccess();

  return HAL_OK;
}

/**
  * @brief Check if the access to the device secrets is blocked.
  * @retval hal_tamp_secrets_status_t Device secrets access status.
  */
hal_tamp_secrets_status_t HAL_TAMP_IsBlockedDeviceSecretsAccess(void)
{
  return (hal_tamp_secrets_status_t) LL_TAMP_IsBlockedDeviceSecretsAccess();
}

/**
  * @brief Erase the backup registers and device secrets.
  * @retval HAL_OK
  */
hal_status_t HAL_TAMP_EraseDeviceSecrets(void)
{
  LL_TAMP_EraseDeviceSecrets();
  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup TAMP_Exported_Functions_Remap
  * @{
  *
  * This section provides functions allowing to manage the Tamp remap pin features:
  * - Call HAL_TAMP_EnableRemap() to enable TAMP pin remap.
  * - Call HAL_TAMP_DisableRemap() to disable TAMP pin remap.
  * - Call HAL_TAMP_IsEnabledRemap() to check that the selected TAMP pin is remapped or not.
  *
  */

/**
  * @brief  Enable remap of TAMP INx / OUTx on different pin(s).
  * @param tamp_remap Specifies tamp pins to remap, can be a combination of
  *         @arg @ref HAL_TAMP_REMAP_TAMP_IN2_PA0_TO_PC1
  *         @arg @ref HAL_TAMP_REMAP_TAMP_IN3_PA1_TO_PA2
  */
void HAL_TAMP_EnableRemap(uint32_t tamp_remap)
{
  ASSERT_DBG_PARAM(IS_TAMP_REMAP(tamp_remap));

  LL_TAMP_EnableRemap(tamp_remap);
}

/**
  * @brief  Disable remap of TAMP INx / OUTx on different pin(s).
  * @param tamp_remap Specifies tamp pins to disable remap, can be a combination of
  *         @arg @ref HAL_TAMP_REMAP_TAMP_IN2_PA0_TO_PC1
  *         @arg @ref HAL_TAMP_REMAP_TAMP_IN3_PA1_TO_PA2
  */
void HAL_TAMP_DisableRemap(uint32_t tamp_remap)
{
  ASSERT_DBG_PARAM(IS_TAMP_REMAP(tamp_remap));

  LL_TAMP_DisableRemap(tamp_remap);
}

/**
  * @brief  Check if remap TAMP INx / OUTx is enabled or disabled.
  * @param  tamp_remap  Specifies tamp pins to get the remap status, can be a value of
  *         @arg @ref HAL_TAMP_REMAP_TAMP_IN2_PA0_TO_PC1
  *         @arg @ref HAL_TAMP_REMAP_TAMP_IN3_PA1_TO_PA2
  * @retval hal_tamp_remap_status_t Tamp remap status.
  */
hal_tamp_remap_status_t HAL_TAMP_IsEnabledRemap(uint32_t tamp_remap)
{
  ASSERT_DBG_PARAM(IS_TAMP_REMAP(tamp_remap));

  return (hal_tamp_remap_status_t)LL_TAMP_IsEnabledRemap(tamp_remap);
}

/**
  * @}
  */

/** @addtogroup TAMP_Exported_Functions_Attributes
  * @{
  *
  * This section provides functions for managing security, privilege  configurations:
  * - Call HAL_TAMP_SetPrivAttr() to set the privilege attribute of specified TAMP item(s).
  * - Call HAL_TAMP_GetPrivAttr() to get the privilege attribute state of specified TAMP item.
  *
  */

/**
  * @brief  Set TAMP item(s) privilege configuration.
  * @param  item This parameter can be one of the following values:
  *         @arg @ref HAL_TAMP_PRIV_ITEM_TAMP
  *         @arg @ref HAL_TAMP_PRIV_ITEM_BACKUP_ZONE_1
  *         @arg @ref HAL_TAMP_PRIV_ITEM_BACKUP_ZONE_2
  * @param priv_attr This parameter is an element of @ref hal_tamp_priv_attr_t enumeration.
  * @retval HAL_ERROR Non-Privileged write to a privilege-only register.
  * @retval HAL_OK    Privilege has been correctly configured.
  */
hal_status_t HAL_TAMP_SetPrivAttr(uint32_t item, hal_tamp_priv_attr_t priv_attr)
{
  ASSERT_DBG_PARAM(IS_TAMP_PRIV_ITEM(item));
  ASSERT_DBG_PARAM(IS_TAMP_ITEM_PRIV_ATTR(priv_attr));

  if (STM32_IS_PRIVILEGED_EXECUTION() == 0U)
  {
    return HAL_ERROR;
  }

  LL_TAMP_SetPrivAttr(item, (uint32_t)priv_attr);

  return HAL_OK;
}

/**
  * @brief  Get TAMP item privilege configuration.
  * @param  item This parameter can be one of the following values:
  *         @arg @ref HAL_TAMP_PRIV_ITEM_TAMP
  *         @arg @ref HAL_TAMP_PRIV_ITEM_BACKUP_ZONE_1
  *         @arg @ref HAL_TAMP_PRIV_ITEM_BACKUP_ZONE_2
  * @retval Returned value is an element of @ref hal_tamp_priv_attr_t enumeration.
  */
hal_tamp_priv_attr_t HAL_TAMP_GetPrivAttr(uint32_t item)
{
  ASSERT_DBG_PARAM(IS_TAMP_PRIV_ITEM(item));

  return (hal_tamp_priv_attr_t)LL_TAMP_GetPrivAttr(item);
}

/**
  * @}
  */

/** @addtogroup TAMP_Exported_Functions_For_Backup_Zone
  * @{
  *
  * This section provides functions to manage backup register
  * zones and their privilege configuration.
  * The backup register zone boundaries can be configured and retrieved using:
  *  - HAL_TAMP_SetBackupRegisterZones() to configure the end index of Backup Register Zone 1 and Zone 2.
  *  - HAL_TAMP_GetBackupRegisterZones() to get the last valid index
  *    of Backup Register Zone 1 and Zone 2.
  *
  */

/**
  * @brief  Configure the protection boundaries for backup register zones.
  * @param  zone1_backup_register_nbr  Last valid backup register index for Backup Register Zone 1.
  *                                    Value from 0 to 32.
  * @param  zone2_backup_register_nbr  Last valid backup register index for Backup Register Zone 2.
  *                                    Value from 0 to 32.
  * @retval HAL_OK    Backup register zones have been set successfully.
  */
hal_status_t HAL_TAMP_SetBackupRegisterZones(uint32_t zone1_backup_register_nbr,
                                             uint32_t zone2_backup_register_nbr)
{
  ASSERT_DBG_PARAM((zone1_backup_register_nbr + zone2_backup_register_nbr) <= LL_TAMP_BACKUP_NB);

