MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_tamp.c
  LL_TAMP_SetBackupRegProtection(zone1_backup_register_nbr, zone1_backup_register_nbr + zone2_backup_register_nbr);

  return HAL_OK;
}

/**
  * @brief  Retrieve backup register zones protection boundaries.
  * @param  p_zone1_backup_register_nbr Pointer to a variable that will receive the last valid
  *                                     backup register index of Backup Register Zone 1.
  *                                     Returned value is from 0 to 32.
  * @param  p_zone2_backup_register_nbr Pointer to a variable that will receive the last valid
  *                                     backup register index of Backup Register Zone 2.
  *                                     Returned value is from 0 to 32.
  * @retval HAL_OK            Backup register zones boundaries have been retrieved successfully.
  * @retval HAL_INVALID_PARAM Parameter value is NULL.
  */
hal_status_t HAL_TAMP_GetBackupRegisterZones(uint32_t *p_zone1_backup_register_nbr,
                                             uint32_t *p_zone2_backup_register_nbr)
{
  ASSERT_DBG_PARAM(p_zone1_backup_register_nbr != NULL);
  ASSERT_DBG_PARAM(p_zone2_backup_register_nbr != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_zone1_backup_register_nbr == NULL) || (p_zone2_backup_register_nbr == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  *p_zone1_backup_register_nbr = LL_TAMP_GetBackupRegStartZone2();
  *p_zone2_backup_register_nbr = LL_TAMP_GetBackupRegStartZone3() - LL_TAMP_GetBackupRegStartZone2();

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup TAMP_Exported_Functions_Callback HAL TAMP callback functions
  * @{
  *
  * Callback functions that the user can overwrite for the different interrupts:
  *  - Internal tampers.
  *  - External tampers.
  *
  */

/**
  * @brief Internal tamper event callback.
  * @param internal_tampers This parameter can be a combination of
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_3
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_4
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_5
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_6
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_9
  *        @arg @ref HAL_TAMP_INTERNAL_TAMPER_11
  */
__WEAK void HAL_TAMP_InternalTamperEventCallback(uint32_t internal_tampers)
{
  STM32_UNUSED(internal_tampers);
  /* NOTE: This function must not be modified in this file, when the callback is needed,
           the HAL_TAMP_InternalTamperEventCallback() can be implemented in the user file.
   */
}

/**
  * @brief External tamper event callback.
  * @param tampers This parameter can be a combination of
  *        @arg @ref HAL_TAMP_TAMPER_1
  *        @arg @ref HAL_TAMP_TAMPER_2
  *        @arg @ref HAL_TAMP_TAMPER_3
  */
__WEAK void HAL_TAMP_TamperEventCallback(uint32_t tampers)
{
  STM32_UNUSED(tampers);
  /* NOTE: This function must not be modified in this file, when the callback is needed,
           the HAL_TAMP_TamperEventCallback() can be implemented in the user file.
   */
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* USE_HAL_TAMP_MODULE */

/**
  * @}
  */

/**
  * @}
  */
